tinyos/tinyos-main/tos/chips/cortex/m3/sam3/u/hsmci/sam3uhsmcihardware.h
//*-----------------------------------------------
// SDIO Commands
//*-----------------------------------------------
// CMD5, R4
#define AT91C_SDIO_SEND_OP_COND (5 | AT91C_MCI_TRCMD_NO \
                                   | AT91C_MCI_SPCMD_NONE \
                                   | AT91C_MCI_RSPTYP_48 \
                                   | AT91C_MCI_OPDCMD)

// CMD52, R5
#define AT91C_SDIO_IO_RW_DIRECT (52| AT91C_MCI_TRCMD_NO \
                                   | AT91C_MCI_SPCMD_NONE \

//*-----------------------------------------------
// Constants
//*-----------------------------------------------
#define SD_STAT_DATA_BUS_WIDTH_4BIT      0x2
#define SD_STAT_DATA_BUS_WIDTH_1BIT      0x0

#define STATUS_APP_CMD           (1 << 5)
#define STATUS_SWITCH_ERROR      (1 << 7)
#define STATUS_READY_FOR_DATA    (1 << 8)
#define STATUS_IDLE              (0 << 9)
#define STATUS_READY             (1 << 9)
#define STATUS_IDENT             (2 << 9)
#define STATUS_STBY              (3 << 9)
#define STATUS_TRAN              (4 << 9)
#define STATUS_DATA              (5 << 9)
#define STATUS_RCV               (6 << 9)
#define STATUS_PRG               (7 << 9)
#define STATUS_DIS               (8 << 9)
#define STATUS_STATE             (0xF << 9)
#define STATUS_ERASE_RESET       (1 << 13)
#define STATUS_WP_ERASE_SKIP     (1 << 15)
#define STATUS_CIDCSD_OVERWRITE  (1 << 16)
#define STATUS_OVERRUN           (1 << 17)
#define STATUS_UNERRUN           (1 << 18)
#define STATUS_ERROR             (1 << 19)
#define STATUS_CC_ERROR          (1 << 20)
#define STATUS_CARD_ECC_FAILED   (1 << 21)
#define STATUS_ILLEGAL_COMMAND   (1 << 22)
#define STATUS_COM_CRC_ERROR     (1 << 23)
#define STATUS_UN_LOCK_FAILED    (1 << 24)
#define STATUS_CARD_IS_LOCKED    (1 << 25)
#define STATUS_WP_VIOLATION      (1 << 26)
#define STATUS_ERASE_PARAM       (1 << 27)
#define STATUS_ERASE_SEQ_ERROR   (1 << 28)
#define STATUS_BLOCK_LEN_ERROR   (1 << 29)
#define STATUS_ADDRESS_MISALIGN  (1 << 30)
#define STATUS_ADDR_OUT_OR_RANGE (1 << 31)

#define STATUS_STOP ( STATUS_CARD_IS_LOCKED \
                        | STATUS_COM_CRC_ERROR \
                        | STATUS_ILLEGAL_COMMAND \
                        | STATUS_CC_ERROR \
                        | STATUS_ERROR \
                        | STATUS_STATE \
                        | STATUS_READY_FOR_DATA )

#define STATUS_WRITE ( STATUS_ADDR_OUT_OR_RANGE \
                        | STATUS_ADDRESS_MISALIGN \
                        | STATUS_BLOCK_LEN_ERROR \
                        | STATUS_WP_VIOLATION \
                        | STATUS_CARD_IS_LOCKED \
                        | STATUS_COM_CRC_ERROR \
                        | STATUS_ILLEGAL_COMMAND \
                        | STATUS_CC_ERROR \
                        | STATUS_ERROR \
                        | STATUS_ERASE_RESET \
                        | STATUS_STATE \
                        | STATUS_READY_FOR_DATA )

#define STATUS_READ  ( STATUS_ADDR_OUT_OR_RANGE \
                        | STATUS_ADDRESS_MISALIGN \
                        | STATUS_BLOCK_LEN_ERROR \
                        | STATUS_CARD_IS_LOCKED \
                        | STATUS_COM_CRC_ERROR \
                        | STATUS_ILLEGAL_COMMAND \
                        | STATUS_CARD_ECC_FAILED \
                        | STATUS_CC_ERROR \
                        | STATUS_ERROR \
                        | STATUS_ERASE_RESET \
                        | STATUS_STATE \
                        | STATUS_READY_FOR_DATA )

#define STATUS_SD_SWITCH ( STATUS_ADDR_OUT_OR_RANGE \
                            | STATUS_CARD_IS_LOCKED \
                            | STATUS_COM_CRC_ERROR \
                            | STATUS_ILLEGAL_COMMAND \
                            | STATUS_CARD_ECC_FAILED \
                            | STATUS_CC_ERROR \
                            | STATUS_ERROR \
                            | STATUS_UNERRUN \
                            | STATUS_OVERRUN \
                            | STATUS_STATE)

#define STATUS_MMC_SWITCH ( STATUS_CARD_IS_LOCKED \
                            | STATUS_COM_CRC_ERROR \
                            | STATUS_ILLEGAL_COMMAND \
                            | STATUS_CC_ERROR \
                            | STATUS_ERROR \
                            | STATUS_ERASE_RESET \
                            | STATUS_STATE \
                            | STATUS_READY_FOR_DATA \
                            | STATUS_SWITCH_ERROR )

//*-----------------------------------------------
// Return Types
//*-----------------------------------------------
typedef struct hsmci_sd_r1 {
  uint32_t status : 32;
  uint32_t cmd_index   :  6;
} __attribute__((__packed__)) hsmci_sd_r1_t;

typedef struct hsmci_sd_r2 {
  union {
    struct {
      uint32_t reserved0 : 1;
      uint32_t crc7      : 7;
      uint32_t mdt       : 12;
      uint32_t reserved1 : 4;
      uint32_t psn       : 32;
      uint32_t prv       : 8;
      uint64_t pnm       : 40;
      uint32_t oid       : 16;
      uint32_t mid       : 8;
    } __attribute__((__packed__)) cid;
    struct {
      uint32_t reserved6          : 1;
      uint32_t crc                : 7;
      uint32_t reserved5          : 2;
      uint32_t file_format        : 2;
      uint32_t tmp_write_protect  : 1;
      uint32_t perm_write_protect : 1;
      uint32_t copy               : 1;
      uint32_t file_format_grp    : 1;
      uint32_t reserved4          : 5;
      uint32_t write_bl_partial   : 1;
      uint32_t write_bl_len       : 4;
      uint32_t r2w_factor         : 3;
      uint32_t reserved3          : 2;
      uint32_t wp_grp_enable      : 1;
      uint32_t wp_grp_size        : 7;
      uint32_t sector_size        : 7;
      uint32_t erase_blk_en       : 1;
      uint32_t c_size_mult        : 3;
      uint32_t vdd_w_curr_max     : 3;
      uint32_t vdd_w_curr_min     : 3;
      uint32_t vdd_r_curr_max     : 3;
      uint32_t vdd_r_curr_min     : 3;
      uint32_t c_size             : 12;
      uint32_t reserved1          : 2;
      uint32_t dsr_imp            : 1;
      uint32_t read_blk_misalign  : 1;
      uint32_t write_blk_misalign : 1;
      uint32_t read_bl_partial    : 1;
      uint32_t read_bl_len        : 4;
      uint32_t ccc                : 12;
      uint32_t tran_speed         : 8;
      uint32_t nsac               : 8;
      uint32_t taac               : 8;
      uint32_t reserved0          : 6;
      uint32_t csd_structure      : 2;
    } __attribute__((__packed__)) v1_csd;
    struct {
      uint32_t reserved6          : 1;
      uint32_t crc                : 7;
      uint32_t reserved5          : 2;
      uint32_t file_format        : 2;
      uint32_t tmp_write_protect  : 1;
      uint32_t perm_write_protect : 1;
      uint32_t copy               : 1;
      uint32_t file_format_grp    : 1;
      uint32_t reserved4          : 5;
      uint32_t write_bl_partial   : 1;
      uint32_t write_bl_len       : 4;
      uint32_t r2w_factor         : 3;
      uint32_t reserved3          : 2;
      uint32_t wp_grp_enable      : 1;
      uint32_t wp_grp_size        : 7;
      uint32_t sector_size        : 7;
      uint32_t erase_blk_en       : 1;
      uint32_t reserved2          : 1;
      uint32_t c_size             : 22;
      uint32_t reserved1          : 6;
      uint32_t dsr_imp            : 1;
      uint32_t read_blk_misalign  : 1;
      uint32_t write_blk_misalign : 1;
      uint32_t read_bl_partial    : 1;
      uint32_t read_bl_len        : 4;
      uint32_t ccc                : 12;
      uint32_t tran_speed         : 8;
      uint32_t nsac               : 8;
      uint32_t taac               : 8;
      uint32_t reserved0          : 6;
      uint32_t csd_structure      : 2;
    } __attribute__((__packed__)) csd;
  };
} hsmci_sd_r2_t;

typedef struct hsmci_sd_r3 {
  struct {
    uint32_t reserved0 : 8;
    uint32_t ocr       : 16;
    uint32_t s18a      : 1;
    uint32_t reserved1 : 4;
    uint32_t reserved2 : 1;
    uint32_t ccs       : 1;
    uint32_t busy      : 1;
  } __attribute__((__packed__)) ocr;
} hsmci_sd_r3_t;

typedef struct hsmci_sd_r6 {
  uint32_t status : 16;
  uint32_t rca    : 16;
} __attribute__((__packed__)) hsmci_sd_r6_t;

typedef struct hsmci_sd_r7 {
  uint32_t cpattern : 8;
  uint32_t vrange   : 4;
} __attribute__((__packed__)) hsmci_sd_r7_t;

#endif // _SAM3UHSMCIHARDWARE_H
